Tekla.Structures.Dialog.HelpViewer
Class for viewing help files with Tekla Structures HelpViewer.exe.
using System;
using Tekla.Structures.Dialog;
public class Example
{
public bool Example1()
{
// [*] Help root location is defined in registry key "HelpLocation". "HelpLocation" registry key's path is defined in HelpViewer.exe's configration file.
// Tekla Structures is running and file "example_help_topic" is located at
// location[*]\[Language] folder where [language] is active language in Tekla Structures.
HelpViewer.DisplayHelpTopic("example_help_topic");
// If Tekla Structures is not running, HelpViewer can be started independently by providing the path to the HelpViewer.exe, help topic and language.
HelpViewer.DisplayHelpTopicIndependent(@"D:\CustomPath\HelpViewer.exe", "example_help_topic", "enu");
}
}

Tekla.Structures.Dialog.HelpViewer.HelpViewerExecutable
Name of the help viewer.

Tekla.Structures.Dialog.HelpViewer.DefaultLanguage
Default language.

Tekla.Structures.Dialog.HelpViewer.DisplayHelpTopic(System.String)
Method for opening Tekla Structures help viewer with given help topic.
Method requires Tekla Structures to be running.
helpTopic: Help topic (e.g. Help file name without extension).
Returns: True if success, otherwise false.
Throws System.InvalidOperationException: Thrown when connection to Tekla Structures failed.

Tekla.Structures.Dialog.HelpViewer.DisplayHelpTopicIndependent(System.String,System.String,System.String)
Method for opening Tekla Structures help viewer independently from given file path with given help topic and language.
helpViewerFilePath: Full file path to HelpViewer.exe containing the name of the executable.
helpTopic: Help topic (e.g. Help file name without extension).
language: Help language. Defaults to enu.
Returns: True if success, otherwise false.

Tekla.Structures.Dialog.HelpViewer.StartHelpViewer(System.String,System.String)
Method for starting help viewer with given path and arguments.
helpViewerFilePath: Full file path to HelpViewer.exe containing the name of the executable.
arguments: Arguments to be used.
Returns: True if success, otherwise false.